biddr_api/biddr_api/app/controllers/api/v1/auctions_controller.rb

    def index
        auctions = Auction.order(created_at: :desc)
---
SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC

    def show
        @auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create

        auction = Auction.new(auction_params)
        auction.user = current_user

        if auction.save
---
INSERT INTO "auctions" ("title", "body", "end_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sad"], ["body", "sad"], ["end_date", "2021-11-02"], ["created_at", "2021-11-20 01:37:28.277072"], ["updated_at", "2021-11-20 01:37:28.277072"], ["user_id", 43]]